# DWGImportOptions Constructor (DWGImportOptions) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWGImportOptions Constructor (DWGImportOptions)
DWGImportOptions Class See Also
---
Constructs a new instance of DWGImportOptions as a copy of the import options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public DWGImportOptions(
	DWGImportOptions option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As DWGImportOptions _
)
```

Visual C++
---
```text
public:
DWGImportOptions(
	DWGImportOptions^ option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.DB..::..DWGImportOptions The options to be copied.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DWGImportOptions Class
DWGImportOptions Overload
Autodesk.Revit.DB Namespace